<!DOCTYPE html>
<!--
 | Generated by Apache Maven Doxia at 2014-12-22 
 | Rendered using Apache Maven Fluido Skin 1.3.1
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="Date-Revision-yyyymmdd" content="20141222" />
    <meta http-equiv="Content-Language" content="en" />
    <title>phynixx-doc - </title>
    <link rel="stylesheet" href="./css/apache-maven-fluido-1.3.1.min.css" />
    <link rel="stylesheet" href="./css/site.css" />
    <link rel="stylesheet" href="./css/print.css" media="print" />

      
    <script type="text/javascript" src="./js/apache-maven-fluido-1.3.1.min.js"></script>

    
                  </head>
        <body class="topBarDisabled">
          
        
    
        <div class="container-fluid">
          <div id="banner">
        <div class="pull-left">
                                <div id="bannerLeft">
                <h2>Phynixx Doc.</h2>
                </div>
                      </div>
        <div class="pull-right">  </div>
        <div class="clear"><hr/></div>
      </div>

      <div id="breadcrumbs">
        <ul class="breadcrumb">
                
                    
                  <li id="publishDate">Last Published: 2014-12-22
                      <span class="divider">|</span>
                   </li>
                  <li id="projectVersion">Version: 2.0.0-SNAPSHOT
                      </li>
                      
                
                    
      
                            </ul>
      </div>

            
      <div class="row-fluid">
        <div id="leftColumn" class="span3">
          <div class="well sidebar-nav">
                
                    
                <ul class="nav nav-list">
                    <li class="nav-header">Phynixx</li>
                              
      <li>
  
                          <a href="project-info.html" title="Project Information">
          <i class="none"></i>
        Project Information</a>
            </li>
                              <li class="nav-header">Documentation</li>
                              
      <li class="active">
  
            <a href="#"><i class="none"></i>Getting Started</a>
          </li>
                
      <li>
  
                          <a href="tutorial.html" title="Tutorial">
          <i class="none"></i>
        Tutorial</a>
            </li>
                
      <li>
  
                          <a href="background.html" title="Background">
          <i class="none"></i>
        Background</a>
            </li>
                
      <li>
  
                          <a href="references.html" title="Referenzen">
          <i class="none"></i>
        Referenzen</a>
            </li>
            </ul>
                
                    
                
          <hr />

           <div id="poweredBy">
                            <div class="clear"></div>
                            <div class="clear"></div>
                            <div class="clear"></div>
                            <div class="clear"></div>
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="builtBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                  </div>
          </div>
        </div>
        
                
        <div id="bodyColumn"  class="span9" >
                                  
            <h1>Getting Started</h1>
<p>Das Projekt <i>Phynixx</i> bietet eine einfache M&#xf6;glichkeit f&#xfc;r Ressourcen an Transaktionen teilnehmen zu nehmen, seien es lokale oder globale (XA-protokoll, 2PC-) Transaktionen. Stellen Sie sich z.B. jede Form von Ressource vor, deren Zustand sich an dem Ausgang einer Datenbanktransaktion orientiert. + Dateioperationen + Operationen an Filesysteme + NoSQL-Datenbanken ohne transaktionale Unterest&#xfc;tzung + Operationen an Archivsystemen ( welche keine eigenes Transaktionshandling anbieten; z.B. Centera von EMC). + Implementierung des Command-Pattern nach GoF. Dies enth&#xe4;lt eine Form von <i>rollback</i> durch <i>undo</i>.</p>
<p>All diese Beispiele stellen transaktionale Ressourcen dar. Sie m&#xfc;ssen an lokalen Transaktionen (Transaktionen,.welche sich nur auf diese Ressource beziehen) oder globalen Transaktionen ( 2-PhaseCommit oder auch XA-Transaktionen) teilnehmen teilnehmen k&#xf6;nnen.</p>
<p>Ein solche Ressource muss einen Minimum an Funktionalit&#xe4;t bereitsstellen und Phynixx erm&#xf6;glich ihr die Teilnahme an beiden Transaktionsprotokollen.</p>
<p>Im Tutorial (siehe <a href="tutorial.html">Tutorial</a>) wird gezeigt, wie das sequentielle Schreiben in eine Datei transaktional mit Phynixx unterst&#xfc;tzt wird.</p>
<div class="section">
<div class="section">
<h3>Was tr&#xe4;gt Phynixx bei, um transaktionales Verhalten zu erm&#xf6;glichen?<a name="Was_trgt_Phynixx_bei_um_transaktionales_Verhalten_zu_ermglichen"></a></h3>
<p>&#160;</p></div></div>
<div class="section">
<h2>Wiederherstellungsinformationen<a name="Wiederherstellungsinformationen"></a></h2>
<p>Jede transaktionalen Ressource, welche Informationen ausserhalb der JVM persistiert (Datenbank, Archivsysteme, Dateien, Dateisysteme, &#x2026;), muss sicherstellen, dass sie schlussendlich konsistent ist. Konsistenz muss auch erreicht werden, wenn w&#xe4;hrend der Transaktion das Filesystem, das Netzwerk oder die JVM wegbricht.<br />Dazu unterst&#xfc;tzt Phynixx transaktionale Ressource, w&#xe4;hrend der Transaktion zu Informationen sichern, die ihreren konsistenz Zustand beschreiben. Falls die Transaktion nicht korrekt abgeschlossen wird, so kann die transaktionale Ressource auf Basis dieser Wiederherstellungsinformationen auf einen konsistenten Stand gebracht werden (<i>Recovery Prozess</i>).</p>
<p>Das Verfahren, Wiederherstellungsinformationen zu sichern, muss selbst einige Vorrausetzungen erf&#xfc;llen. In erster Linie m&#xfc;ssen Wiederherstellungsinformationen dauerhaft und atomar gesichert werden. Entweder werden sie verl&#xe4;sslich und vollst&#xe4;ndig gesichert oder gar nicht. Es muss zu jedem Zeitpunkt offensichtlich sein, welche Wiederherstellungsinormationen gesichert sind.</p></div>
<div class="section">
<h2>lokale Transaktionen<a name="lokale_Transaktionen"></a></h2>
<p>Um an Transaktionen teilzunehmen, muss nur eine <tt>commit-</tt> und <tt>rollback-</tt>Methode bereitgestellt werden. </p>
<p>Dar&#xfc;berhinaus steuert Phynixx Aspekte bei, welche Ihrer transaktionalen Ressource <i>out of the box</i> zu Gute kommen:</p>

<ul>
  
<li>Bereitstellung eines Persistenzmechanismus f&#xfc;r Wiederherstellungsinformtionen</li>
  
<li>Teilnahme am Recoveryverfahren</li>
  
<li>Unterst&#xfc;tzung von <i>autocommit</i></li>
  
<li>Unterst&#xfc;tzung von <i>ConnectionPooling</i></li>
  
<li>Integration in <i>spring transaktion management</i></li>
</ul></div>
<div class="section">
<h2>2 PhaseCommit Protokoll<a name="a2_PhaseCommit_Protokoll"></a></h2>
<p>Das 2 PhaseCommit Protokoll ist unumg&#xe4;nglich, wenn Sie ihre transaktionale Ressource gemeinsam mit andern Ressourcen (i.d.R. eine releationale datenbank) in einer Transaktion nutzen wollen. Ein 2PC-f&#xe4;higer Transaktionsmanager steuert die Transaktion und die Abh&#xe4;ngigkeit der transaktionalen Ressourcen untereinander. F&#xfc;r Java ist das 2PC-Protokoll in [JTA] definiert. </p>
<p>Die Kommunitaktion mit 2PC-f&#xe4;higen Transaktionsmanagern ist komplex. <i>Phynixx</i> erledigt die gesamte Kommunikation f&#xfc;r Sie und macht ihre transaktionale Ressource ohne zus&#xe4;tzliche Programmierung zu einer 2PC-f&#xe4;higen transaktionalen Ressource. </p>
<p>&#160;</p>
<h1>Viel Spa&#xdf; mit Phynixx.</h1></div>
                  </div>
            </div>
          </div>

    <hr/>

    <footer>
            <div class="container-fluid">
                      <div class="row-fluid">
                              <p >Copyright &copy;                   2014.
          All rights reserved.      
                    
      </p>
        </div>

        
        
                </div>
    </footer>
        </body>
</html>
